<HTML>
<TITLE>Батыров Денис Дамирович</TITLE>
<BODY>
 <h1>Батыров Денис Дамирович</h1><p>
Задача 2.5.<p>
Найти значение переменной z, заданной суммой функций. Для нахождения значения
функции f(u,t) написать пользовательскую функцию. Числа a и b – случайные.<p>
5 Вариант.<p>
<?php
$a = rand(-20, 20);
$b = rand(-20, 20);
print('a = '. $a . '<br>'); //Выводим
print('b = '. $b . '<br>'); //Выводим

//z1
if (($a>=0) AND ($b*$b-$a>=0)){
    $z1=$a-2*($b*$b-$a);
}

elseif (($a<0) AND ($b*$b-$a>=0)){
  $z1=$a+($b*$b-$a);
}

elseif (($a>=0) AND ($b*$b-$a<0)){
  $z1=$a*$a-2*($b*$b-$a);
}

elseif (($a<0) AND ($b*$b-$a<0)){
  $z1=$a*($b*$b-$a)+3*($b*$b-$a);
}

//z2
if (($a>=0) AND ($b>=0)){
    $z2=$a-2*$b;
}

elseif (($a<0) AND ($b>=0)){
  $z2=$a+$b;
} 

elseif (($a>=0) AND ($b<0)){
  $z2=$a*$a-2*$b;
} 

elseif (($a<0) AND ($b<0)){
  $z2=$a*$b+3*$b;
} 

print('z = f(a,b^2-a) + f(a,b) '. '<br>'); //Выводим
$z=$z1+$z2;
print('f(a,b^2-a) = '. $z1 . '<br>'); //Выводим
print('f(a,b) = '. $z2 . '<br>'); //Выводим
print('z = '. $z); //Выводим
?>
</BODY>
</HTML>